<a href="https://colab.research.google.com/github/Chirag1997aggarwal/ineuronAssignments/blob/main/datacleaning_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Datacleaning Pandas
- From ineuron.io
- https://drive.google.com/file/d/1ISetIhHbrX2_s8aUe5V0yMI4NwzBA32q/view

Setup -
Take this monstrosity as the DataFrame to use in the following puzzles:


df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [49]:
import numpy as np
import pandas as pd

In [50]:
data = {\
        'From_To': [\
                    'LoNDon_paris', 
                    'MAdrid_miLAN', 
                    'londON_StockhOlm', 
                    'Budapest_PaRis', 
                    'Brussels_londOn'
                    ], 
        'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
        'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
        'Airline': [\
                    'KLM(!)', 
                    ' (12)', 
                    '(British Airways. )', 
                    '12. Air France', 
                    '"Swiss Air"']
        }
df = pd.DataFrame(data)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []                 (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

Question 1) Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [51]:
value = {1:10055, 3:10075}
df['FlightNumber'].fillna(value=value, inplace=True)
df['FlightNumber'] = df['FlightNumber'].astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []                 (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

Question 2) The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [52]:
temp_df = pd.DataFrame()
temp_df['From'], temp_df['To'] = zip(*df['From_To'].map(lambda x: x.split('_')))
temp_df

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

Question 3) Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [53]:
temp_df['From'] = temp_df['From'].str.capitalize()
temp_df['To'] = temp_df['To'].str.capitalize()
temp_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

Question 4) Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [54]:
del df['From_To']
df['From'] = temp_df['From']
df['To'] = temp_df['To']
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []                 (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

Question 5) In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.

Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [55]:
max_delay_count = 0
for i, row in df.iterrows():
  if len(row['RecentDelays']) > max_delay_count:
    max_delay_count = len(row['RecentDelays'])
print(max_delay_count)

3

In [56]:
def process(x):
  t = []
  for i in range(max_delay_count):
    try:
      t.append(x[i])
    except:
      t.append(None)
  return t

In [57]:
temp_df = pd.DataFrame(zip(*df['RecentDelays'].map(lambda x: process(x))))
temp_df = temp_df.transpose()

In [58]:
del df['RecentDelays']
for i in range(max_delay_count):
  df['delay_'+str(i+1)] = temp_df[i]

In [59]:
df

   FlightNumber              Airline      From  ... delay_1 delay_2 delay_3
0         10045               KLM(!)    London  ...      23      47     NaN
1         10055                 (12)    Madrid  ...    None    None    None
2         10065  (British Airways. )    London  ...      24      43      87
3         10075       12. Air France  Budapest  ...      13     NaN     NaN
4         10085          "Swiss Air"  Brussels  ...      67      32     NaN

[5 rows x 7 columns]